package main

import (
	"math/rand"
	"time"
)

//Characters of random string generator
var charsLowercase = "abcdefghijklmnopqrstuvwxyz"
var charsUppercase = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
var charsNumber = "0123456789"
var charsSpecial = "[](){}^;:#?.,&|!~`_%$@\"'=+-*/\\ <>"
var charsEmoji = "😀😃😄😁😆😅😂🤣😊😇🙂🙃😉😌😍\U0001F970😘😗😙😚😋😛😝😜🤪🤨🧐🤓😎🤩\U0001F973😏😒😞😔😟😕🙁😣😖😫😩\U0001F97A😢😭😤😠😡🤬🤯😳\U0001F975\U0001F976😱😨😰😥😓🤗🤔🤭🤫🤥😶😐😑😬🙄😯😦😧😮😲\U0001F971😴🤤😪😵🤐\U0001F974🤢🤮🤧😷🤒🤕🤑🤠😈👿👹👺🤡💩👻💀👽👾🤖🎃😺😸😹😻😼😽🙀😿😾\U0001F9BE\U0001F9BF🧠\U0001F9B7👀👅👄🧞🧟👯💏💋💑👪🗣👤👥👣\U0001F9F3🌂\U0001F9F5\U0001F9F6👓🕶\U0001F97D\U0001F97C👔👕👖🧣🧤🧥🧦👗👘\U0001F97B\U0001FA71\U0001FA72\U0001FA73👙👚👛👜👝🎒👞👟\U0001F97E\U0001F97F👠👡👢👑👒🎩🧢⛑💄💍🏻🏼🏽🏾👋🤚🖐✋🖖👌\U0001F90F🤞🤟🤘🤙👈👉👆🖕👇👍👎✊👊🤛🤜👏🙌👐🤲🙏💅🤳💪\U0001F9B5\U0001F9B6👂\U0001F9BB👃👶🧒👦👧\U0001F9B1\U0001F9B0👱\U0001F9B3\U0001F9B2🧔🧓👴👵🙍🙎🙅🙆💁🙋\U0001F9CF🙇🤦🤷🎓💼👮🕵💂👷🤴👸👳👲🧕🤵👰🤰🤱👼🎅🤶\U0001F9B8\U0001F9B9🧙🧚🧛🧜🧝💆💇🚶\U0001F9CD\U0001F9CE👨👩🏃💃🕺🕴🧖🤝🧑👬👭👫🏿🐶🐱🐭🐹🐰🦊🐻🐼🐨🐯🦁🐮🐷🐽🐸🐵🙈🙉🙊🐒🐔🐧🐦🐤🐣🐥🦆🦅🦉🦇🐺🐗🐴🦄🐝🐛🦋🐌🐞🐜\U0001F99F🦗🕷🕸🦂🐢🐍🦎🦖🦕🐙🦑🦐\U0001F99E🦀🐡🐠🐟🐬🐳🐋🦈🐊🐅🐆🦓🦍\U0001F9A7🐘\U0001F99B🦏🐪🐫🦒\U0001F998🐃🐂🐄🐎🐖🐏🐑\U0001F999🐐🦌🐩\U0001F9AE🐕\U0001F9BA🐈🐓🦃\U0001F99A\U0001F99C\U0001F9A2\U0001F9A9🕊🐇\U0001F99D\U0001F9A8\U0001F9A1\U0001F9A6\U0001F9A5🐁🐀🐿🦔🐾🐉🐲🌵🎄🌲🌳🌴🌱🌿🍀🎍🎋🍃🍂🍁🍄🐚🌾💐🌷🌹🥀🌺🌸🌼🌻🌞🌝🌛🌜🌚🌕🌖🌗🌘🌑🌒🌓🌔🌙🌎🌍🌏\U0001FA90💫⭐🌟✨⚡💥🔥🌪🌤⛅🌥🌦🌧⛈🌩🌨⛄🌬💨💧💦🌊🌫🍏🍎🍐🍊🍋🍌🍉🍇🍓🍈🍒🍑\U0001F96D🍍🥥🥝🍅🍆🥑🥦\U0001F96C🥒🌶🌽🥕\U0001F9C4\U0001F9C5🥔🍠🥐\U0001F96F🍞🥖🥨🧀🥚🍳\U0001F9C8🥞\U0001F9C7🥓🥩🍗🍖\U0001F9B4🌭🍔🍟🍕🥪🥙\U0001F9C6🌮🌯🥗🥘🥫🍝🍜🍲🍛🍣🍱🥟\U0001F9AA🍤🍙🍚🍘🍥🥠\U0001F96E🍢🍡🍧🍨🍦🥧\U0001F9C1🍰🎂🍮🍭🍬🍫🍿🍩🍪🌰🥜🍯🥛🍼🍵\U0001F9C3🥤🍶🍺🍻🥂🍷🥃🍸🍹\U0001F9C9🍾\U0001F9CA🥄🍴🍽🥣🥡🥢\U0001F9C2⚽🏀🏈\U0001F94E🎾🏐🏉\U0001F94F🎱\U0001FA80🏓🏸🏒🏑\U0001F94D🏏🥅⛳\U0001FA81🏹🎣\U0001F93F🥊🥋🎽\U0001F6F9🛷⛸🥌🎿⛷🏂\U0001FA82🏋🤼🤸⛹🤺🤾🏌🏇🧘🏄🏊🤽🚣🧗🚵🚴🏆🥇🥈🥉🏅🎖🏵🎗🎫🎟🎪🤹🎭\U0001FA70🎨🎬🎤🎧🎼🎹🥁🎷🎺🎸\U0001FA95🎻🎲🎯🎳🎮🎰\U0001F9E9🚗🚕🚙🚌🚎🏎🚓🚑🚒🚐🚚🚛🚜\U0001F9AF\U0001F9BD\U0001F9BC🛴🚲🛵🏍\U0001F6FA🚨🚔🚍🚘🚖🚡🚠🚟🚃🚋🚞🚝🚄🚅🚈🚂🚆🚇🚊🚉🛫🛬🛩💺🛰🚀🛸🚁🛶⛵🚤🛥🛳⛴🚢⛽🚧🚦🚥🚏🗺🗿🗽🗼🏰🏯🏟🎡🎢🎠⛲⛱🏖🏝🏜🌋⛰🏔🗻🏕⛺🏠🏡🏘🏚🏗🏭🏢🏬🏣🏤🏥🏦🏨🏪🏫🏩💒🏛⛪🕌🕍\U0001F6D5🕋⛩🛤🛣🗾🎑🏞🌅🌄🌠🎇🎆🌇🌆🏙🌃🌌🌉🌁⌚📱📲💻⌨🖥🖨🖱🖲🕹🗜💽💾💿📀📼📷📸📹🎥📽🎞📞☎📟📠📺📻🎙🎚🎛\U0001F9ED⏱⏲⏰🕰⌛⏳📡🔋🔌💡🔦🕯\U0001FA94\U0001F9EF🛢💸💵💴💶💷💰💳💎\U0001F9F0🔧🔨🛠⛏🔩\U0001F9F1⛓\U0001F9F2🔫💣\U0001F9E8\U0001FA93🔪🗡🛡🚬🏺🔮📿\U0001F9FF💈🔭🔬🕳\U0001FA79\U0001FA7A💊💉\U0001FA78\U0001F9EC\U0001F9A0\U0001F9EB\U0001F9EA🌡\U0001F9F9\U0001F9FA\U0001F9FB🚽🚰🚿🛁🛀\U0001F9FC\U0001FA92\U0001F9FD\U0001F9F4🛎🔑🗝🚪\U0001FA91🛋🛏🛌\U0001F9F8🖼🛍🛒🎁🎈🎏🎀🎊🎉🎎🏮🎐\U0001F9E7✉📩📨📧💌📥📤📦🏷📪📫📬📭📮📯📜📃📄📑\U0001F9FE📊📈📉🗒🗓📆📅🗑📇🗃🗳🗄📋📁📂🗂🗞📰📓📔📒📕📗📘📙📚📖🔖\U0001F9F7🔗📎🖇📐📏\U0001F9EE📌📍🖊🖋🖌🖍📝🔍🔎🔏🔐🔒🔓🧡💛💚💙💜🖤\U0001F90D\U0001F90E💔❣💕💞💓💗💖💘💝💟🕉🔯🕎🛐⛎🆔🉑☢☣📴📳🈶🈚🈸🈺🈷🆚💮🉐㊙㊗🈴🈵🈹🈲🅰🅱🆎🆑🅾🆘❌⭕🛑⛔📛🚫💯💢🚷🚯🚳🚱🔞📵🚭❗❕❓❔‼⁉🔅🔆〽⚠🚸🔱🔰♻✅🈯💹❎🌐💠Ⓜ🌀💤🏧🚾♿🅿🈳🈂🛂🛃🛄🛅🚹🚺🚼🚻🚮🎦📶🈁🔣ℹ🔤🔡🔠🆖🆗🆙🆒🆕🆓🔟🔢#*⃣⏏⏸⏯⏹⏺⏭⏮⏩⏪⏫⏬🔼🔽🔀🔁🔂🔄🔃🎵🎶➕➖➗♾💲💱™©®〰➰➿🔚🔙🔛🔝🔜🔘🔴\U0001F7E0\U0001F7E1\U0001F7E2🔵\U0001F7E3⚫⚪\U0001F7E4🔺🔻🔸🔹🔶🔷🔳🔲◾◽\U0001F7E5\U0001F7E7\U0001F7E8\U0001F7E9\U0001F7E6\U0001F7EA⬛⬜\U0001F7EB🔈🔇🔉🔊🔔🔕📣📢👁🗨💬💭🗯🃏🎴🀄🕐🕑🕒🕓🕔🕕🕖🕗🕘🕙🕚🕛🕜🕝🕞🕟🕠🕡🕢🕣🕤🕥🕦🕧🏁🚩🏳🌈🏴‍☠️🎌✢✣✤✥★☆✯✡✩✪✫✬✭✮✶✷✵✸✹✺❊✻✽✼❉✱✲✾❃❋✳✴❇❈※❅❆❄✿❀❁❂🟀🟁🟂🟃🟄🟅🟆🟇🟈🟉🟊🟋🟌🟍🟎🟏🟐🟑🟒🟓🟔∙•・◦●○◎◉⦿⁌⁍♠♣♥♦♤♧♡♢🂡🂢🂣🂤🂥🂦🂧🂨🂩🂪🂫🂬🂭🂮🂱🂲🂳🂴🂵🂶🂷🂸🂹🂺🂻🂼🂽🂾🃁🃂🃃🃄🃅🃆🃇🃈🃉🃊🃋🃌🃍🃎🃑🃒🃓🃔🃕🃖🃗🃘🃙🃚🃛🃜🃝🃞🃟♚♛♜♝♞♟♔♕♖♗♘♙⚀⚁⚂⚃⚄⚅🂠⚈⚉⚆⚇🀰🀱🀲🀳🀴🀵🀶🀷🀸🀹🀺🀻🀼🀽🀾🀿🁀🁁🁂🁃🁄🁅🁆🁇🁈🁉🁊🁋🁌🁍🁎🁏🁐🁑🁒🁓🁔🁕🁖🁗🁘🁙🁚🁛🁜🁝🁞🁟🁠🁡🁢🁣🁤🁥🁦🁧🁨🁩🁪🁫🁬🁭🁮🁯🁰🁱🁲🁳🁴🁵🁶🁷🁸🁹🁺🁻🁼🁽🁾🁿🂀🂁🂂🂃🂄🂅🂆🂇🂈🂉🂊🂋🂌🂍🂎🂏🂐🂑🂒🂓🀀🀁🀂🀃🀅🀆🀇🀈🀉🀊🀋🀌🀍🀎🀏🀐🀑🀒🀓🀔🀕🀖🀗🀘🀙🀚🀛🀜🀝🀞🀟🀠🀡🀢🀣🀤🀥🀦🀧🀨🀩🀪🀫→⇒⟹⇨⇾➾⇢➔➜➙➛➝➞➟➠➡➥➦➧➨⥤⇀⇁⥛⥟⇰➩➪➫➬➭➮➯➱➲➳➵➸➻➺➼➽⟶⇉⇶⇛⇏⤃↛↝⤳↣↠↦⟼⤅⤇⟾⇥⥓⥗⇝⟿↬⇴⇸⇻⤀⤁⤍⤏⤐⤑⤔⤕⤖⤗⤘⤙⤛⤞⤠⥴⥵⥱⥲⥇⥈←⇐⟸⇦⇽⇠☚☜⬅⥢⟵↼↽⥚↚↜↢↞↤⟻⤆⟽⇇⇤⥒⥖⥞⇚⇍⤂⇜↫⇷⇺⤌⤎⤚⤜⤝⤟⥳↑⇑⇡☝⬆⇧⇪⥣↟↾↿⥔⥘⥜⥠⟰⤊↥⇫⇬⇭⇮⇯⇈⤉⇞⤒⥉↓⇓⇩⇣☟⬇⥥↡⇂⇃⥝⥡⇊⟱⤋↧⥕⥙↯⤈⇟⤓↔⇔⟺⬄⇿⬌⟷⥊⥋⥎⥐⥦⥧⥨⥩⥪⥫⥬⥭⇋⇌⇄⇆↹⇎⤄↭↮⇹⇼⥂⥃⥄↕⇕⇳⬍⥌⥍⥏⥑⥮⥯⇅↨⇵↘➘⇘⬂⬊⇲➷➴⤥⤵⤷↗➚⇗⬀⬈➹➶⤤⤴↖⇖⬁⬉⤣↸⇱↙⇙⬃⬋⤦⤶⤹⤡⤢⤸↵↲↩↳↪↰↱↴↶↷↺⟲⥀↻⟳⤾⤿⤺⤻⤼⤽⥆⥅⥁⤧⤨⤩⤪⤫⤬⤭⤮⤯⤰⤱⤲⥶⥷⥸⥺⥰⥹⥻⥼⥽⥾⥿⎯⏐▶▷‣▸▹►▻◀◁▼▽▾▿▴▵▲△☞☛➢➣➤☀☼☽☾☁☂☔☃☇☈☻☹☺☕✌✍✎✏✐✑✒✁✂✃✄⚾✇✈⚓♨♈♉♊♋♌♍♎♏♐♑♒♓☉☿♀♁♂♃♄♅⛢♆♇☄⚲⚢⚣⚤⚦⚧⚨⚩⚬⚭⚮⚯⚰⚱☊☋☌☍✦✧✙✚✛✜✝✞✟✠☦☨☩☥♰♱☓⚜☤⚚⚕⚖⚗⚙⚘☘⚛☧⚒☭☪☫☬⚑⚐☮☯☸⚔☗☖■□☐☑☒▪▫◻◼◘◆◇❖✓✔✕✖✗✘﹅﹆❍❏❐❑❒✰❤︎❥☙❧❦❡🞡🞢🞣🞤🞥🞦🞧🞨🞩🞪🞫🞬🞭🞮€¥¢£₽₨₩฿₺₮₱₭₴₦৲৳૱௹﷼₹₲₪₡₫៛₵₢₸₤₳₥₠₣₰₧₯₶₷𓀀𓀁𓀂𓀃𓀄𓀅𓀆𓀇𓀈𓀉𓀊𓀋𓀌𓀍𓀎𓀏𓀐𓀑𓀒𓀓𓀔𓀕𓀖𓀗𓀘𓀙𓀚𓀛𓀜𓀝𓀞𓀟𓀠𓀡𓀢𓀣𓀤𓀥𓀦𓀧𓀨𓀩𓀪𓀫𓀬𓀭𓀮𓀯𓀰𓀱𓀲𓀳𓀴𓀵𓀶𓀷𓀸𓀹𓀺𓀻𓀼𓀽𓀾𓀿𓁀𓁁𓁂𓁃𓁄𓁅𓁆𓁇𓁈𓁉𓁊𓁋𓁌𓁍𓁎𓁏𓁐𓁑𓁒𓁓𓁔𓁕𓁖𓁗𓁘𓁙𓁚𓁛𓁜𓁝𓁞𓁟𓁠𓁡𓁢𓁣𓁤𓁥𓁦𓁧𓁨𓁩𓁪𓁫𓁬𓁭𓁮𓁯𓁰𓁱𓁲𓁳𓁴𓁵𓁶𓁷𓁸𓁹𓁺𓁻𓁼𓁽𓁾𓁿𓂀𓂁𓂂𓂃𓂄𓂅𓂆𓂇𓂈𓂉𓂊𓂋𓂌𓂍𓂎𓂏𓂐𓂑𓂒𓂓𓂔𓂕𓂖𓂗𓂘𓂙𓂚𓂛𓂜𓂝𓂞𓂟𓂠𓂡𓂢𓂣𓂤𓂥𓂦𓂧𓂨𓂩𓂪𓂫𓂬𓂭𓂮𓂯𓂰𓂱𓂲𓂳𓂴𓂵𓂶𓂷𓂸𓂹𓂺𓂻𓂼𓂽𓂾𓂿𓃀𓃁𓃂𓃃𓃄𓃅𓃆𓃇𓃈𓃉𓃊𓃋𓃌𓃍𓃎𓃏𓃐𓃑𓃒𓃓𓃔𓃕𓃖𓃗𓃘𓃙𓃚𓃛𓃜𓃝𓃞𓃟𓃠𓃡𓃢𓃣𓃤𓃥𓃦𓃧𓃨𓃩𓃪𓃫𓃬𓃭𓃮𓃯𓃰𓃱𓃲𓃳𓃴𓃵𓃶𓃷𓃸𓃹𓃺𓃻𓃼𓃽𓃾𓃿𓄀𓄁𓄂𓄃𓄄𓄅𓄆𓄇𓄈𓄉𓄊𓄋𓄌𓄍𓄎𓄏𓄐𓄑𓄒𓄓𓄔𓄕𓄖𓄗𓄘𓄙𓄚𓄛𓄜𓄝𓄞𓄟𓄠𓄡𓄢𓄣𓄤𓄥𓄦𓄧𓄨𓄩𓄪𓄫𓄬𓄭𓄮𓄯𓄰𓄱𓄲𓄳𓄴𓄵𓄶𓄷𓄸𓄹𓄺𓄻𓄼𓄽𓄾𓄿𓅀𓅁𓅂𓅃𓅄𓅅𓅆𓅇𓅈𓅉𓅊𓅋𓅌𓅍𓅎𓅏𓅐𓅑𓅒𓅓𓅔𓅕𓅖𓅗𓅘𓅙𓅚𓅛𓅜𓅝𓅞𓅟𓅠𓅡𓅢𓅣𓅤𓅥𓅦𓅧𓅨𓅩𓅪𓅫𓅬𓅭𓅮𓅯𓅰𓅱𓅲𓅳𓅴𓅵𓅶𓅷𓅸𓅹𓅺𓅻𓅼𓅽𓅾𓅿𓆀𓆁𓆂𓆃𓆄𓆅𓆆𓆇𓆈𓆉𓆊𓆋𓆌𓆍𓆎𓆏𓆐𓆑𓆒𓆓𓆔𓆕𓆖𓆗𓆘𓆙𓆚𓆛𓆜𓆝𓆞𓆟𓆠𓆡𓆢𓆣𓆤𓆥𓆦𓆧𓆨𓆩𓆪𓆫𓆬𓆭𓆮𓆯𓆰𓆱𓆲𓆳𓆴𓆵𓆶𓆷𓆸𓆹𓆺𓆻𓆼𓆽𓆾𓆿𓇀𓇁𓇂𓇃𓇄𓇅𓇆𓇇𓇈𓇉𓇊𓇋𓇌𓇍𓇎𓇏𓇐𓇑𓇒𓇓𓇔𓇕𓇖𓇗𓇘𓇙𓇚𓇛𓇜𓇝𓇞𓇟𓇠𓇡𓇢𓇣𓇤𓇥𓇦𓇧𓇨𓇩𓇪𓇫𓇬𓇭𓇮𓇯𓇰𓇱𓇲𓇳𓇴𓇵𓇶𓇷𓇸𓇹𓇺𓇻𓇼𓇽𓇾𓇿𓈀𓈁𓈂𓈃𓈄𓈅𓈆𓈇𓈈𓈉𓈊𓈋𓈌𓈍𓈎𓈏𓈐𓈑𓈒𓈓𓈔𓈕𓈖𓈗𓈘𓈙𓈚𓈛𓈜𓈝𓈞𓈟𓈠𓈡𓈢𓈣𓈤𓈥𓈦𓈧𓈨𓈩𓈪𓈫𓈬𓈭𓈮𓈯𓈰𓈱𓈲𓈳𓈴𓈵𓈶𓈷𓈸𓈹𓈺𓈻𓈼𓈽𓈾𓈿𓉀𓉁𓉂𓉃𓉄𓉅𓉆𓉇𓉈𓉉𓉊𓉋𓉌𓉍𓉎𓉏𓉐𓉑𓉒𓉓𓉔𓉕𓉖𓉗𓉘𓉙𓉚𓉛𓉜𓉝𓉞𓉟𓉠𓉡𓉢𓉣𓉤𓉥𓉦𓉧𓉨𓉩𓉪𓉫𓉬𓉭𓉮𓉯𓉰𓉱𓉲𓉳𓉴𓉵𓉶𓉷𓉸𓉹𓉺𓉻𓉼𓉽𓉾𓉿𓊀𓊁𓊂𓊃𓊄𓊅𓊆𓊈𓊉𓊊𓊋𓊌𓊍𓊎𓊏𓊐𓊑𓊒𓊓𓊔𓊕𓊖𓊗𓊘𓊙𓊚𓊛𓊜𓊝𓊞𓊟𓊠𓊡𓊢𓊣𓊤𓊥𓊦𓊧𓊨𓊩𓊪𓊫𓊬𓊭𓊮𓊯𓊰𓊱𓊲𓊳𓊴𓊵𓊶𓊷𓊸𓊹𓊺𓊻𓊼𓊽𓊾𓊿𓋀𓋁𓋂𓋃𓋄𓋅𓋆𓋇𓋈𓋉𓋊𓋋𓋌𓋍𓋎𓋏𓋐𓋑𓋒𓋓𓋔𓋕𓋖𓋗𓋘𓋙𓋚𓋛𓋜𓋝𓋞𓋟𓋠𓋡𓋢𓋣𓋤𓋥𓋦𓋧𓋨𓋩𓋪𓋫𓋬𓋭𓋮𓋯𓋰𓋱𓋲𓋳𓋴𓋵𓋶𓋷𓋸𓋹𓋺𓋻𓋼𓋽𓋾𓋿𓌀𓌁𓌂𓌃𓌅𓌆𓌇𓌈𓌉𓌊𓌋𓌌𓌍𓌎𓌏𓌐𓌑𓌒𓌓𓌔𓌕𓌖𓌗𓌘𓌙𓌚𓌛𓌜𓌝𓌞𓌟𓌠𓌡𓌢𓌣𓌤𓌥𓌦𓌧𓌨𓌩𓌪𓌫𓌬𓌭𓌮𓌯𓌰𓌱𓌲𓌳𓌴𓌵𓌶𓌷𓌸𓌹𓌺𓌻𓌼𓌽𓌾𓌿𓍀𓍁𓍂𓍃𓍄𓍅𓍆𓍇𓍈𓍉𓍊𓍋𓍌𓍍𓍎𓍏𓍐𓍑𓍒𓍓𓍔𓍕𓍖𓍗𓍘𓍙𓍚𓍛𓍜𓍝𓍞𓍟𓍠𓍡𓍢𓍣𓍤𓍥𓍦𓍧𓍨𓍩𓍪𓍫𓍬𓍭𓍮𓍯𓍰𓍱𓍲𓍳𓍴𓍵𓍶𓍷𓍸𓍹𓍺𓍻𓍼𓍽𓍾𓍿𓎀𓎁𓎂𓎃𓎄𓎅𓎆𓎇𓎈𓎉𓎊𓎋𓎌𓎍𓎏𓎐𓎑𓎒𓎓𓎔𓎕𓎖𓎗𓎘𓎙𓎚𓎛𓎜𓎝𓎞𓎟𓎠𓎡𓎢𓎣𓎤𓎥𓎦𓎧𓎨𓎩𓎪𓎫𓎬𓎭𓎮𓎯𓎰𓎱𓎲𓎳𓎴𓎵𓎶𓎷𓎸𓎹𓎺𓎻𓎼𓎽𓎾𓎿𓏀𓏁𓏂𓏃𓏄𓏅𓏆𓏇𓏈𓏉𓏊𓏋𓏌𓏍𓏎𓏏𓏐𓏑𓏒𓏓𓏔𓏕𓏖𓏗𓏘𓏙𓏚𓏛𓏜𓏝𓏞𓏟𓏠𓏡𓏢𓏣𓏤𓏥𓏦𓏧𓏨𓏩𓏪𓏫𓏬𓏭𓏮𓏯𓏰𓏱𓏲𓏳𓏴𓏵𓏶𓏷𓏸𓏹𓏺𓏻𓏼𓏽𓏾𓏿𓐀𓐁𓐂𓐃𓐄𓐅𓐆𓐇𓐈𓐉𓐊𓐋𓐌𓐍𓐎𓐏𓐐𓐑𓐒𓐓𓐔𓐕𓐖𓐗𓐘𓐙𓐚𓐛𓐜𓐝𓐞𓐟𓐠𓐡𓐢𓐣𓐤𓐥𓐦𓐧𓐨𓐩𓐪𓐫𓐬𓐭𓐮"

func randomString(length int, containsLowercase bool, containsUppercase bool, containsNumber bool, containsSpecial bool, containsEmoji bool) string {
	if !containsLowercase && !containsUppercase && !containsNumber && !containsSpecial && !containsEmoji {
		return ""
	}
	if length < 1 {
		return ""
	}

	var chars []rune

	if containsLowercase {
		chars = append(chars, []rune(charsLowercase)...)
	}
	if containsUppercase {
		chars = append(chars, []rune(charsUppercase)...)
	}
	if containsNumber {
		chars = append(chars, []rune(charsNumber)...)
	}
	if containsSpecial {
		chars = append(chars, []rune(charsSpecial)...)
	}
	if containsEmoji {
		chars = append(chars, []rune(charsEmoji)...)
	}

	rand.Seed(time.Now().UnixNano())

	b := make([]rune, length)
	for i := range b {
		b[i] = chars[rand.Intn(len(chars))]
	}
	return string(b)
}

func randomStringFrom(length int, chars string) string {
	if length < 1 {
		return ""
	}

	rand.Seed(time.Now().UnixNano())

	b := make([]rune, length)
	for i := range b {
		b[i] = []rune(chars)[rand.Intn(len([]rune(chars)))]
	}
	return string(b)
}
